package korea;

public class korea_history_2000 implements korea_case_3{		//오버라이드를 사용하여 history 클래스에서 적용하였다.
	@Override
	public void show() {
		System.out.println("2000년대 즈음 대중문화가 발전하면서 대한민국 시장만으로는 대중문화 산업을 감당할 수 없게 되었고, 이에 기업들은 대한민국에서 벗어나 더 넓은 시장으로의 진출을 모색하기 시작했다.\n그리고 얼마 안 있어 2000년 2월에 대한민국의 댄스 그룹 H.O.T.가 베이징에서 공연을 하면서 본격적인 중국에서의 한류를 일으켰다.\n 이후 2003년 베이비복스의 곡인 〈I’m Still Loving You〉는 발매 후 중국에서 차트 1위, 대만에서 4위, 홍콩에서 2위, 태국에서 1위를 기록하며 성공을 거두었다.\n 2005년 베이징에서 열린 정지훈의 공연 “Rainy day-Beijing”은 관객 4만 명을 동원하며 큰 성공을 이루었다. 한편, 2001년 보아가 일본에서 출시한 정규 음반 《Listen to My Heart》는 대한민국 노래 최초로 오리콘 앨범차트 1위에 오르는 성과를 내었다.\n");
		System.out.println("2000년에 방영된 드라마 《가을동화》는 같은 해 대만에 수출된 후로 여러 나라에서 관심을 모았다. 또한 이 드라마의 영향으로 드라마의 촬영지를 보기 위해 외국에서 찾아오는 관광객이 등장했다. \n대한민국의 영화 《쉬리》는 2000년에 일본에서 개봉하면서 흥행 1위를 달성했다. 2003년에 공개된 드라마 《대장금》 또한 여러 나라에서 관심을 받았는데, \n이 드라마는 단순한 대중문화 이외에도 한국의 전통문화를 함께 외국에 알렸다는 점에 의의가 있다. 2003년에는 드라마 《겨울연가》가 일본에 수출되면서 인기를 끌었으며, \n2004년에는 《풀하우스》가 아시아에서 인기를 끌었다.\n");
		System.out.println("2008년에는 드라마 《주몽》이 이란에서 시청률 85%를 기록하며 큰 인기를 끌었다. 이어서 여러 대한민국 드라마들이 이란에서 인기를 끌었고, \n현지 언론은 대한민국 드라마 관련 기사를 비중 있게 다루며 직접 드라마 촬영 장소를 찾기도 하였다.\n또, 네팔에서는 《엽기적인 그녀》 같은 대한민국 영화가 인기를 끌어 일부 젊은이들 사이에서 “사랑해요(Sarang hyo)” 같은 한국어가 유행하기도 했다.\n");
		System.out.println("2009년 대한민국의 아이돌 그룹 동방신기는 한국 그룹 최초로 도쿄돔 무대에 섰다.\n이후 2000년대 후반 동방신기가 소속사와의 분쟁으로 인해 활동이 주춤하자, 소녀시대나 카라와 같은 걸그룹들이 해외 진출의 주를 이루었다. \n2009년 카라는 《Pretty Girl》로 태국의 ‘AS TV 아시아 팝 차트’에서 1위를 달성했으며 태국 네티즌들에 의해 패러디 영상이 만들어지는 등 인기를 끌었다.\n");
		System.out.println("출처: 위키백과");
	}
	public String give() {
		return "2000년대 즈음 대중문화가 발전하면서 대한민국 시장만으로는 대중문화 산업을 감당할 수 없게 되었고, 이에 기업들은 대한민국에서 벗어나 더 넓은 시장으로의 진출을 모색하기 시작했다.\n그리고 얼마 안 있어 2000년 2월에 대한민국의 댄스 그룹 H.O.T.가 베이징에서 공연을 하면서 본격적인 중국에서의 한류를 일으켰다.\n 이후 2003년 베이비복스의 곡인 〈I’m Still Loving You〉는 발매 후 중국에서 차트 1위, 대만에서 4위, 홍콩에서 2위, 태국에서 1위를 기록하며 성공을 거두었다.\n 2005년 베이징에서 열린 정지훈의 공연 “Rainy day-Beijing”은 관객 4만 명을 동원하며 큰 성공을 이루었다. 한편, 2001년 보아가 일본에서 출시한 정규 음반 《Listen to My Heart》는 대한민국 노래 최초로 오리콘 앨범차트 1위에 오르는 성과를 내었다.\n\n"
				+ "2000년에 방영된 드라마 《가을동화》는 같은 해 대만에 수출된 후로 여러 나라에서 관심을 모았다. 또한 이 드라마의 영향으로 드라마의 촬영지를 보기 위해 외국에서 찾아오는 관광객이 등장했다. \n대한민국의 영화 《쉬리》는 2000년에 일본에서 개봉하면서 흥행 1위를 달성했다. 2003년에 공개된 드라마 《대장금》 또한 여러 나라에서 관심을 받았는데, \n이 드라마는 단순한 대중문화 이외에도 한국의 전통문화를 함께 외국에 알렸다는 점에 의의가 있다. 2003년에는 드라마 《겨울연가》가 일본에 수출되면서 인기를 끌었으며, \n2004년에는 《풀하우스》가 아시아에서 인기를 끌었다.\n\n"
				+ "2008년에는 드라마 《주몽》이 이란에서 시청률 85%를 기록하며 큰 인기를 끌었다. 이어서 여러 대한민국 드라마들이 이란에서 인기를 끌었고, \n현지 언론은 대한민국 드라마 관련 기사를 비중 있게 다루며 직접 드라마 촬영 장소를 찾기도 하였다.\n또, 네팔에서는 《엽기적인 그녀》 같은 대한민국 영화가 인기를 끌어 일부 젊은이들 사이에서 “사랑해요(Sarang hyo)” 같은 한국어가 유행하기도 했다.\n\n"
				+ "2009년 대한민국의 아이돌 그룹 동방신기는 한국 그룹 최초로 도쿄돔 무대에 섰다.\n이후 2000년대 후반 동방신기가 소속사와의 분쟁으로 인해 활동이 주춤하자, 소녀시대나 카라와 같은 걸그룹들이 해외 진출의 주를 이루었다. \n2009년 카라는 《Pretty Girl》로 태국의 ‘AS TV 아시아 팝 차트’에서 1위를 달성했으며 태국 네티즌들에 의해 패러디 영상이 만들어지는 등 인기를 끌었다.\n\n출처: 위키백과\n\n";

	}
}