package korea;

public class korea_history_2010 implements korea_case_3{
	@Override
	public void show() {
		System.out.println("2000년대 말부터 대한민국의 문화콘텐츠 기업들은 아시아 지역에서 벗어나 다양한 지역으로의 진출을 시도하기 시작했다. \n가수로서 일본에서 인기를 끌었던 보아는 2008년 미국 진출을, 대한민국 내에서 인기를 끌었던 원더걸스는 2009년 미국 진출을 선언했다. \n하지만 모두 큰 성과는 거두지 못하고 대한민국이나 일본으로 복귀하게 되었다.\n");
		System.out.println("하지만 2011년에는 SM엔터테인먼트가 프랑스 파리와 미국 뉴욕에서 ‘SM타운 콘서트’를 성공적으로 진행했고, \n2012년에는 한류 팬들을 대상으로 한 컨벤션 KCON이 성황리에 개최되었다. \n또, 2013년에는 슈퍼주니어가 상파울루, 리마, 산티아고, 부에노스아이레스, 멕시코시티 등 남미 도시에서 성공적으로 콘서트를 개최하였다.\n");
		System.out.println("2012년에는 싸이의 《강남스타일》이 세계적으로 인기를 끌었다. 《강남스타일》은 기존의 서양에 존재했던 소수의 한류 커뮤니티뿐만 아니라 대중사회에서도 인기를 끌었으며, \n2012년 9월에는 미국 빌보드 차트에서 2위를 차지했다. \n또, 2014년 5월 31일에는 유튜브 최초로 조회수 20억 건을 돌파하는 성과를 내기도 했다. \n이에 버락 오바마 미국 대통령은 2013년 한·미 정상회담 도중 “세계의 많은 사람들이 대한민국 문화에 매료당하고 있다”면서 딸들이 자신에게 강남스타일 춤을 가르쳐 줬던 일화를 언급했다.\n");
		System.out.println("한편, 아시아에서는 대한민국 예능이 인기를 얻기 시작했다. 《신서유기》는 중국 QQ닷컴에서 1천만 뷰를 돌파해 인기를 끌었으며,\n 《런닝맨》은 중국, 인도네시아 등지에서 인기를 끌었다.\r\n"
				+ "\r\n"
				+ "그 이후 방탄소년단이 등장하며 세계적으로 큰 인기를 끌게 되었다. \n그러나 이 역시 소수 언어인 한국어를 사용하고 있는 동안에는 인기를 끌지 못했으며, 다수가 사용하고 있는 영어 보컬로서 활동한 이후 큰 인기를 끌게 되었다.\n");
		System.out.println("출처: 위키백과");
	}
	public String give() {
		return "2000년대 말부터 대한민국의 문화콘텐츠 기업들은 아시아 지역에서 벗어나 다양한 지역으로의 진출을 시도하기 시작했다. "+
				"\n가수로서 일본에서 인기를 끌었던 보아는 2008년 미국 진출을, 대한민국 내에서 인기를 끌었던 원더걸스는 2009년 미국 진출을 선언했다. "+
				"\n하지만 모두 큰 성과는 거두지 못하고 대한민국이나 일본으로 복귀하게 되었다."+
				"\n하지만 2011년에는 SM엔터테인먼트가 프랑스 파리와 미국 뉴욕에서 ‘SM타운 콘서트’를 성공적으로 진행했고, "+
				"\n2012년에는 한류 팬들을 대상으로 한 컨벤션 KCON이 성황리에 개최되었다. "+
				"\n또, 2013년에는 슈퍼주니어가 상파울루, 리마, 산티아고, 부에노스아이레스, 멕시코시티 등 남미 도시에서 성공적으로 콘서트를 개최하였다.\n"+
				"\n2012년에는 싸이의 《강남스타일》이 세계적으로 인기를 끌었다. 《강남스타일》은 기존의 서양에 존재했던 소수의 한류 커뮤니티뿐만 아니라 대중사회에서도 인기를 끌었으며, "+
				"\n2012년 9월에는 미국 빌보드 차트에서 2위를 차지했다. "+
				"\n또, 2014년 5월 31일에는 유튜브 최초로 조회수 20억 건을 돌파하는 성과를 내기도 했다. "+
				"\n이에 버락 오바마 미국 대통령은 2013년 한·미 정상회담 도중 “세계의 많은 사람들이 대한민국 문화에 매료당하고 있다”면서 딸들이 자신에게 강남스타일 춤을 가르쳐 줬던 일화를 언급했다.\n"+
				"\n한편, 아시아에서는 대한민국 예능이 인기를 얻기 시작했다. 《신서유기》는 중국 QQ닷컴에서 1천만 뷰를 돌파해 인기를 끌었으며,"+
				"\n 《런닝맨》은 중국, 인도네시아 등지에서 인기를 끌었다.\r\n"
				+ "\r\n"
				+ "그 이후 방탄소년단이 등장하며 세계적으로 큰 인기를 끌게 되었다. \n그러나 이 역시 소수 언어인 한국어를 사용하고 있는 동안에는 인기를 끌지 못했으며, 다수가 사용하고 있는 영어 보컬로서 활동한 이후 큰 인기를 끌게 되었다.\n출처: 위키백과";
	}
}
