package korea;

public class korea_history_1990 implements korea_case_3{
	@Override
	public void show() {
		System.out.print("1987년 6·29 선언으로 인해 대한민국에 민주주의가 들어서기 시작하면서 대중들은 대중문화에 대해 더 많은 관심을 가지기 시작했다. \n이와 함께 SBS를 포함한 여러 케이블 TV, 위성방송 채널 등이 개국하면서 본격적인 상업 방송이 활성화되었고, \n이는 곧 방송 환경의 발달로 이어졌다. 방송 환경의 발달은 대기업 자본의 문화 산업 참여를 유도했고, \n그 결과 체계적인 생산 과정의 도입 등 문화 콘텐츠의 질을 높이는 여러 변화가 일어났다. \n이 과정에서 대한민국의 문화 산업에는 ‘기획’이라는 개념이 본격적으로 자리 잡기 시작했는데, \n그 예로 1990년대에 설립된 기획 영화 제작사 ‘신씨네’, 기획 아이돌 소속사 ‘SM엔터테인먼트’ 등이 있다.\n"
				+ "\r\n"
				+ "1994년, 《쥬라기 공원》의 1년 수익이 자동차 150만 대 수출 수익에 맞먹는다는 사실이 언론을 통해 알려지면서 문화의 경제적 효과에 중점을 둔 ‘문화산업론’이 지지를 얻기 시작했다.\n 그리고 몇 년 후 대한민국의 외환 위기와 IT 산업의 쇠퇴가 겹치면서 산업 구조에 변화가 필요하게 되자 정부는 국가 차원에서 문화 산업을 지지하기 시작했다\n");
		System.out.println("출처: 위키백과");
	}
	public String give() {
		return "1987년 6·29 선언으로 인해 대한민국에 민주주의가 들어서기 시작하면서 대중들은 대중문화에 대해 더 많은 관심을 가지기 시작했다. \n이와 함께 SBS를 포함한 여러 케이블 TV, 위성방송 채널 등이 개국하면서 본격적인 상업 방송이 활성화되었고, \n이는 곧 방송 환경의 발달로 이어졌다. 방송 환경의 발달은 대기업 자본의 문화 산업 참여를 유도했고, \n그 결과 체계적인 생산 과정의 도입 등 문화 콘텐츠의 질을 높이는 여러 변화가 일어났다. \n이 과정에서 대한민국의 문화 산업에는 ‘기획’이라는 개념이 본격적으로 자리 잡기 시작했는데, \n그 예로 1990년대에 설립된 기획 영화 제작사 ‘신씨네’, 기획 아이돌 소속사 ‘SM엔터테인먼트’ 등이 있다.\n"
				+ "\r\n"
				+ "1994년, 《쥬라기 공원》의 1년 수익이 자동차 150만 대 수출 수익에 맞먹는다는 사실이 언론을 통해 알려지면서 문화의 경제적 효과에 중점을 둔 ‘문화산업론’이 지지를 얻기 시작했다.\n 그리고 몇 년 후 대한민국의 외환 위기와 IT 산업의 쇠퇴가 겹치면서 산업 구조에 변화가 필요하게 되자 정부는 국가 차원에서 문화 산업을 지지하기 시작했다\n" + "출처: 위키백과\n\n";
	}
}
